import  numpy as np
"""
学习numpy的索引和切片的操作
"""
t1=np.loadtxt("1.csv",delimiter=",",dtype="float",skiprows=0,usecols=None,unpack=False)
print(t1)
# 按照行取数据 t1[2]:表示取t1的第三行数据
print(t1[2])
# 按照连续的模式取多行
print(f"按照连续的方式取多行:{t1[2:]}")
# 取不连续的多行
# 形式：目标.[[1,4,7]]
print(f"取不连续的多行：{t1[[1,3]]}")
# 取行或者列的通用方法
# 形式:t1.([行号:列好:]) :->表示每一列都要
# 取行的三种形式：
print(f"去行的形式1:{t1[1,:]}")
print(f"取行的形式2:{t1[2:,:]}")
print(f"取行的形式3:{t1[[1,3],:]}")
# 取列的形式
# 取指定的一列
print(f"取指定的一列:{t1[:,1]}")
# 取连续的多列
print(f"取连续的多列:{t1[:,1:]}")
# 取不连续的多列
print(f"取不连续的多列:{t1[:,[0,2]]}")
# 取多行和多列，取第二行和第三列的值
# 取的是交叉点的值
a=t1[1,2]
print(type(a))
print(a)
# 取多行和多列的值，取1到3行，第二列到第三列
b=t1[1:4,2:4]
print(b)
# 取多个不相邻的点
c=t1[[0,1],[1,2]]
print(c)
